import numpy as np


def test(x, y, rho):
    a = 0.05

    print(f"帰無仮説 H0: rho == {rho}")
    print(f"対立仮説 H0: rho != {rho}")
    print(f"有意水準: {a}")

    sx = x.std(ddof=1)
    sy = y.std(ddof=1)
    sxy = np.cov(x, y, ddof=1)[0, 1]

    r = sxy / (sx * sy)
    print(f"標本相関係数 r: {r}")

    z = np.log((1 + r) * (1 - r)) / 2
    print(f"z: {z}")

    e = np.log((1 + rho) * (1 - rho)) / 2
    print(f"eta: {e}")

    f = np.sqrt(x.size - 3) * (z - e)
    print(f"検定統計量: {f}")

    za = 1.960
    print(f"上側確率{a/2} パーセント点: {za}")

    print()
    if np.abs(f) > za:
        print("H0は棄却される")
    else:
        print("H0は棄却されない")

x = np.array([
    41.4, 76.3, 59.2, 51.8, 52.5, 53.2, 62.4, 55.0, 57.7,
    63.2, 37.5, 48.5, 32.4, 20.5, 47.9, 68.9, 68.5, 52.5, 63.3, 58.8,
    59.7, 48.4, 40.7, 51.0, 50.9, 34.3, 25.8, 32.1, 34.4, 55.1, 60.3,
    57.0, 45.6, 54.2, 55.1, 55.7, 70.3, 61.8, 47.6, 42.5, 71.3, 55.2,
    65.2, 42.9, 54.7, 62.0, 48.2
])
y = np.array([
    52.8, 71.2, 72.6, 63.7, 81.3, 81.8, 70.9, 74.0, 73.2,
    72.9, 66.7, 65.7, 43.7, 55.5, 79.6, 85.7, 75.3, 80.5, 73.0, 77.0,
    77.5, 69.2, 60.0, 78.2, 79.5, 61.8, 49.6, 59.6, 72.1, 71.0, 76.3,
    72.8, 71.8, 60.7, 67.0, 71.8, 71.2, 68.3, 68.5, 54.8, 76.0, 65.8,
    69.4, 66.9, 69.7, 71.2, 59.6
])

print("(1)")
test(x, y, 0)

print("\n(2)")
test(x, y, 0.5)
